routes_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Elliot the Dog"], ["email", "dogsdonthaveemail@woof.net"], ["created_at", "2017-08-21 23:30:47.247261"], ["updated_at", "2017-08-21 23:30:47.247261"]]
---
  def create
    user = User.new(user_params)
    if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def update
    @user = User.find(user_params)